[DS_AssaultRifle_LS X2WeaponTemplate]
FriendlyName="Laser Rifle"
FriendlyNamePlural="Laser Rifles"
BriefSummary="The Laser Rifle emits a series of microsecond-duration blasts of light that destroy chemical bonds in targets."
TacticalText="<Bullet/> Use upgrades recovered from ADVENT enemies to improve the laser rifles's tactical effectiveness.\n<Bullet/> Laser weapons receive bonus aim."
AbilityDescName="assault rifle"

[DS_Cannon_LS X2WeaponTemplate]
FriendlyName="Laser Cannon"
FriendlyNamePlural="Laser Cannons"
BriefSummary="Laser weapons tech combined with an improved cooling system will let us deploy a rapid-fire version of the cannon, able to lay down a much deadlier volume of fire."
TacticalText="<Bullet/> The Laser Cannon is a much more powerful, yet equally deployable, version of the Cannon.\n<Bullet/> Use upgrades looted from enemies to improve the Laser Cannon's tactical effectiveness.\n<Bullet/> Laser weapons receive bonus aim."
AbilityDescName="cannon"

[DS_Shotgun_LS X2WeaponTemplate]
FriendlyName="Scatterray"
FriendlyNamePlural="Scatterray"
BriefSummary="The Scatterray is an application of laser technology to provide shotgun-like effects; it is most effective at close range due to beam diffusion."
TacticalText="<Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Use upgrades looted from enemies to improve the Scatterray's tactical effectiveness.\n<Bullet/> Laser weapons receive bonus aim."
AbilityDescName="shotgun"

[DS_SniperRifle_LS X2WeaponTemplate]
FriendlyName="Laser Lance"
FriendlyNamePlural="Laser Lances"
BriefSummary="A long rifle version of the Laser Rifle, the Laser Lance incorporates extremely high-energy flash capacitors, resulting in a high-precision long-range laser weapon."
TacticalText="Sniper rifles always require both actions to fire.\n<Bullet/> They are less accurate at close range, but deadly at a distance.\n<Bullet/> Use upgrades looted from enemies to improve the Laser Lance's tactical effectiveness.\n<Bullet/> Laser weapons receive bonus aim."
AbilityDescName="sniper rifle"


;* ============================================
;* COIL WEAPONS
;* ============================================

[DS_AssaultRifle_CL X2WeaponTemplate]
FriendlyName="Coil Rifle"
FriendlyNamePlural="Coil Rifles"
BriefSummary="A powerful, mid-range, armor-piercing coilgun that fills the assault rifle role."
TacticalText="<Bullet/> Coil weapons automatically pierce (ignore) 1 enemy armor.<br/><Bullet/> Use upgrades recovered from ADVENT enemies to improve the Coil Rifles's tactical effectiveness.<br/>"
AbilityDescName="assault rifle"

[DS_Cannon_CL X2WeaponTemplate]
FriendlyName="Gauss Cannon"
FriendlyNamePlural="Gauss Cannons"
BriefSummary="A heavy duty, automatic coilgun with a huge rate of fire."
TacticalText="<Bullet/> Coil weapons automatically pierce (ignore) 1 enemy armor.<br/><Bullet/> The cannon serves in a squad automatic weapon role, has more ammo and does more damage than its rifle counterpart, but it is cumbersome to carry.<br/><Bullet/> Use upgrades recovered from ADVENT enemies to improve the Gauss Cannon's tactical effectiveness.<br/>"
AbilityDescName="cannon"

[DS_SniperRifle_CL X2WeaponTemplate]
FriendlyName="Gauss Long Rifle"
FriendlyNamePlural="Gauss Long Rifles"
BriefSummary="An extended coil rifle that may be employed by our Sharpshooters."
TacticalText="<Bullet/> Coil weapons automatically pierce (ignore) 1 enemy armor.<br/><Bullet/> Sniper rifles typically require both actions to fire without special training.\n<Bullet/> They are less accurate at close range, but deadly at a distance.\n<Bullet/> Use upgrades looted from enemies to improve the Gauss Long Rifle's tactical effectiveness."
AbilityDescName="sniper rifle"

[DS_Shotgun_CL X2WeaponTemplate]
FriendlyName="Gauss Scattergun"
FriendlyNamePlural="Gauss Scatterguns"
BriefSummary="A close-quarters coil-tech weapon that fills the shotgun role."
TacticalText="<Bullet/> Coil weapons automatically pierce (ignore) 1 enemy armor.<br/><Bullet/> Shotgun-style weapons are extremely effective at close range, but their accuracy drops off quickly at longer range.\n<Bullet/> Use upgrades looted from enemies to improve the Gauss Scattergun's tactical effectiveness."
AbilityDescName="shotgun"